#define _CRT_SECURE_NO_WARNINGS 1
/*
5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果
A选手说：B第二，我第三；
B选手说：我第二，E第四；
C选手说：我第一，D第二；
D选手说：C最后，我第三；
E选手说：我第四，A第一；
比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。
*/
//#include<stdio.h>
//int main() {
//	int A = 0;
//	int B = 0;
//	int C = 0;
//	int D = 0;
//	int E = 0;
//	for(A = 1; A<=5; A++){
//		for (B = 1; B <= 5; B++) {
//			for (C = 1; C <= 5; C++) {
//				for (D = 1; D <= 5; D++) {
//					for (E = 1; E <= 5; E++) {
//						if ((((B != 2) && (A == 3)) == 1) || (((B == 2) && (A != 3)) == 1) == 1) {
//							if ((((B != 2) && (E == 4)) == 1) || (((B == 2) && (E != 4)) == 1) == 1) {
//								if ((((C != 1) && (D == 2)) == 1) || (((C == 1) && (D != 4)) == 1) == 1) {
//									if ((((C != 5) && (D == 3)) == 1) || (((C == 5) && (D != 3)) == 1) == 1) {
//										if ((((E != 4) && (A == 1)) == 1) || (((E == 4) && (A != 1)) == 1) == 1) {
//											if (A != B && A != C && A != D && A != E && B != C && B != D && B != E && C != D && C != E) {
//												printf("A是第%d名\n", A);
//												printf("B是第%d名\n", B);
//												printf("C是第%d名\n", C);
//												printf("D是第%d名\n", D);
//												printf("E是第%d名\n", E);
//											}
//										}
//									}
//								}
//							}
//						}
//					}
//				}
//			}
//		}
//	}
//}
/*
日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个
嫌疑犯的一个。以下为4个嫌疑犯的供词。
A说：不是我。
B说：是C。
C说：是D。
D说：C在胡说
已知3个人说了真话，1个人说的是假话。
现在请根据这些信息，写一个程序来确定到底谁是凶手。
*/
//#include<stdio.h>
//int main() {
//	int x = 0;
//	for (x = 'A'; x <= 'D'; x++) {
//		if (((x != 'A') + (x == 'C') + (x == 'D') + (x != 'D')) == 3) {
//			printf("凶手是%c", x);
//		}
//	}
//}
#include<stdio.h>
#define MAX 100
int main() {
	int i = 0;
	int j = 0;
	int n = 0;
	int a[MAX][MAX] = { 0 };
	scanf("%d", &n);
	for (i = 0; i < n; i++) {
		a[i][0] = 1;
		a[i][i] = 1;
		for (j = 0; j <= i; j++) {
			if (i >= 1 && j >= 1 ) {
				a[i][j] = a[i - 1][j - 1] + a[i - 1][j];
			}
			printf("%d\t", a[i][j]);
		}
			printf("\n");
	}
}